Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.namespace.kubernetes_namespace.vault will be created
+ resource "kubernetes_namespace" "vault" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "vault"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.vault.helm_release.vault will be created
+ resource "helm_release" "vault" {
      + atomic                     = false
      + chart                      = "vault"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "vault"
      + namespace                  = "vault"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.releases.hashicorp.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                global:
                  enabled: true
                  tlsDisable: true
                
                server:
                  # Stateful storage
                  dataStorage:
                    enabled: true
                  auditStorage:
                    enabled: true
                
                  # For HA configuration and because we need to manually init the vault,
                  # we need to define custom readiness/liveness Probe settings
                  readinessProbe:
                    enabled: true
                    path: "/v1/sys/health?standbyok=true&sealedcode=204&uninitcode=204"
                  livenessProbe:
                    enabled: true
                    path: "/v1/sys/health?standbyok=true"
                    initialDelaySeconds: 60
                
                  # This configures the Vault Statefulset to create a PVC for audit logs.
                  # See https://www.vaultproject.io/docs/audit/index.html to know more
                  auditStorage:
                    enabled: true
                  standalone:
                    enabled: false
                
                  # Run Vault in "HA" mode.
                  ha:
                    enabled: true
                    replicas: 3
                    raft:
                      enabled: true
                      setNodeId: true
                
                      config: |
                        ui = true
                        cluster_name = "vault-integrated-storage"
                        listener "tcp" {
                          address = "[::]:8200"
                          cluster_address = "[::]:8201"
                          tls_disable = "true"
                        }
                
                        storage "raft" {
                          path = "/vault/data"
                          retry_join {
                            leader_api_addr = "http://vault-0.vault-internal:8200"
                          }
                          retry_join {
                            leader_api_addr = "http://vault-1.vault-internal:8200"
                          }
                          retry_join {
                            leader_api_addr = "http://vault-2.vault-internal:8200"
                          }
                          autopilot {
                            server_stabilization_time = "10s"
                            last_contact_threshold = "10s"
                            min_quorum = 3
                            cleanup_dead_servers = false
                            dead_server_last_contact_threshold = "10m"
                            max_trailing_logs = 1000
                            disable_upgrade_migration = false
                          }
                        }
                
                # Vault UI
                ui:
                  enabled: true
                  serviceType: "LoadBalancer"
                  serviceNodePort: null
                  externalPort: 8200
            EOT,
        ]
      + verify                     = false
      + version                    = "0.28.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
